app/views/extra/f_logic2.html.erb

<% cache(:controller =>'extra',:action => 'f-logic2') do %>
	<% @books = Book.all %>
---
SELECT "books".* FROM "books"