app/controllers/ajax_controller.rb

SELECT distinct publish FROM "books"
---
	def search
		@books = Book.select('distinct publish')

SELECT "books".* FROM "books" WHERE "books"."publish" = '技術評論社'
---
	def result
		sleep 2
		@books = Book.where(:publish => params[:publish])