app/controllers/clonets_controller.rb

  def index
    @clonets = Clonet.all
---
SELECT "clonets".* FROM "clonets"

  def show
    @clonet = Clonet.find(params[:id])
---
SELECT "clonets".* FROM "clonets" WHERE "clonets"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @clonet = Clonet.find(params[:id])
---
SELECT "clonets".* FROM "clonets" WHERE "clonets"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @clonet = Clonet.new(params[:clonet])

    respond_to do |format|
      if @clonet.save
---
INSERT INTO "clonets" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 11 Nov 2016 21:08:24 UTC +00:00], ["name", "MyString"], ["updated_at", Fri, 11 Nov 2016 21:08:24 UTC +00:00]]

  def update
    @clonet = Clonet.find(params[:id])
---
SELECT "clonets".* FROM "clonets" WHERE "clonets"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @clonet = Clonet.find(params[:id])
    @clonet.destroy
---
SELECT "clonets".* FROM "clonets" WHERE "clonets"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "clonets" WHERE "clonets"."id" = ?  [["id", 980190962]]