app/controllers/configs_controller.rb

  def index
    @configs = Config.all
---
SELECT "configs".* FROM "configs"

  def show
    @config = Config.find(params[:id])
---
SELECT "configs".* FROM "configs" WHERE "configs"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @config = Config.find(params[:id])
---
SELECT "configs".* FROM "configs" WHERE "configs"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @config = Config.new(params[:config])

    respond_to do |format|
      if @config.save
---
INSERT INTO "configs" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 11 Nov 2016 21:08:24 UTC +00:00], ["updated_at", Fri, 11 Nov 2016 21:08:24 UTC +00:00]]

  def update
    @config = Config.find(params[:id])
---
SELECT "configs".* FROM "configs" WHERE "configs"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @config = Config.find(params[:id])
    @config.destroy
---
SELECT "configs".* FROM "configs" WHERE "configs"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "configs" WHERE "configs"."id" = ?  [["id", 980190962]]