app/controllers/ctrl_controller.rb

SELECT "books".* FROM "books"
---
	def get_xml
		@books = Book.all

SELECT "books".* FROM "books"
---
	def get_json
		@books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
---
	def xml_erb
		@book = Book.find(params[:id])

SELECT "books".* FROM "books"
---
	def test_format
		@books = Book.all

SELECT "books".* FROM "books"
---
	def respond_to_all
		@books = Book.all

SELECT "books".* FROM "books"
---
	def test_atom_feed
		@books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---
	def has_many_test
		@book = Book.find(1)

SELECT "books".* FROM "books"
---
	def test_js_key
		@books = Book.all