app/controllers/extra_controller.rb

SELECT "books".* FROM "books"
---
	def f_logic1
		unless fragment_exist?(:controller=>'extra',:action=>'f_logic1')
			@books = Book.all

SELECT "books".* FROM "books" ORDER BY published desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "books"
---
	def paging
		@books = Book.order('published desc')
		.paginate(:page=>params[:page],:per_page=>5)