app/controllers/hello_controller.rb

SELECT "books".* FROM "books"
---
	def list
		@title = "This is Rails 3 title"
		@books = Book.all