app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
	@book = Book.find(params[:book_id])
---
SELECT "reviews".* FROM "reviews"
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1

  def show
    @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "2323"]]

  def edit
    @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]