app/controllers/suns_controller.rb

  def index
    @suns = Sun.all
---
SELECT "suns".* FROM "suns"

  def show
    @sun = Sun.find(params[:id])
---
SELECT "suns".* FROM "suns" WHERE "suns"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @sun = Sun.find(params[:id])
---
SELECT "suns".* FROM "suns" WHERE "suns"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @sun = Sun.new(params[:sun])

    respond_to do |format|
      if @sun.save
---
INSERT INTO "suns" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 02 Dec 2016 20:41:00 UTC +00:00], ["name", "MyString"], ["updated_at", Fri, 02 Dec 2016 20:41:00 UTC +00:00]]

  def update
    @sun = Sun.find(params[:id])
---
SELECT "suns".* FROM "suns" WHERE "suns"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @sun = Sun.find(params[:id])
    @sun.destroy
---
SELECT "suns".* FROM "suns" WHERE "suns"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "suns" WHERE "suns"."id" = ?  [["id", 980190962]]