app/controllers/tennis_controller.rb

SELECT "tennis".* FROM "tennis"
---
  def index
    @tennis = Tenni.all

SELECT "tennis".* FROM "tennis" WHERE "tennis"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @tenni = Tenni.find(params[:id])

SELECT "tennis".* FROM "tennis" WHERE "tennis"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @tenni = Tenni.find(params[:id])

INSERT INTO "tennis" ("created_at", "name", "published", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 02 Dec 2016 20:41:00 UTC +00:00], ["name", "MyString"], ["published", Mon, 14 Nov 2016], ["updated_at", Fri, 02 Dec 2016 20:41:00 UTC +00:00]]
---
  def create
    @tenni = Tenni.new(params[:tenni])

    respond_to do |format|
      if @tenni.save

SELECT "tennis".* FROM "tennis" WHERE "tennis"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @tenni = Tenni.find(params[:id])

SELECT "tennis".* FROM "tennis" WHERE "tennis"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "tennis" WHERE "tennis"."id" = ?  [["id", 980190962]]
---
  def destroy
    @tenni = Tenni.find(params[:id])
    @tenni.destroy