app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = 1
---

<% @book.reviews.each do |review| %>